; domain
(define (domain Dungeon)

    (:requirements :typing :negative-preconditions :conditional-effects :equality
    )

    ; Do not modify the types
    (:types
        location colour key corridor
    )

    ; Do not modify the constants
    (:constants
        red yellow green purple rainbow - colour
    )

    ; You may introduce whatever predicates you would like to use
    (:predicates

        ; One predicate given for free!
        (hero-at ?loc - location)

        ; WORLD
        (connected ?loc - location ?cor - corridor) ; Room is connected to corridor
        (corridor-between ?from ?to - location ?cor - corridor) ; Corridor exists between two locations
        (locked ?cor - corridor) ; Corridor is locked
        (lock-colour ?cor - corridor ?col - colour) ; Corridor lock colour
        (messy ?loc - location) ; Location is messy
        (collapsed ?cor - corridor) ; Corridor is collapsed
        (risky ?cor - corridor) ; Corridor is risky

        ; KEY
        (key-at ?k - key ?loc - location) ; Key is at location
        (key-usable ?k - key) ; Key is usable (has uses left)
        (key-single-use ?k - key) ; Key has one use left
        (key-double-use ?k - key) ; Key has two uses left
        (key-colour ?k - key ?col - colour) ; Key colour

        ; HERO
        (holding ?k - key) ; Hero is holding key
        (arm-free) ; Hero's arm is free (not holding a key)

    )

    ; IMPORTANT: You should not change/add/remove the action names or parameters

    ;Hero can move if the
    ;    - hero is at current location ?from,
    ;    - hero will move to location ?to,
    ;    - corridor ?cor exists between the ?from and ?to locations
    ;    - there isn't a locked door in corridor ?cor
    ;Effects move the hero, and collapse the corridor if it's "risky" (also causing a mess in the ?to location)
    (:action move

        :parameters (?from ?to - location ?cor - corridor)

        :precondition (and

            ; Allow moving only if:
            (hero-at ?from) ; Hero is at the current location
            (corridor-between ?from ?to ?cor) ; Corridor exists between the current and target locations
            (not (locked ?cor)) ; Corridor is not locked
            (not (collapsed ?cor)) ; Corridor has not collapsed

        )

        :effect (and

            ; Set hero to new location and no longer at old location:
            (hero-at ?to)
            (not (hero-at ?from))

            ; Set corridor collapsed and location messy if corridor is risky:
            (when
                (risky ?cor)
                (and
                    (messy ?to)
                    (collapsed ?cor)
                )
            )

        )
    )

    ;Hero can pick up a key if the
    ;    - hero is at current location ?loc,
    ;    - there is a key ?k at location ?loc,
    ;    - the hero's arm is free,
    ;    - the location is not messy
    ;Effect will have the hero holding the key and their arm no longer being free
    (:action pick-up

        :parameters (?loc - location ?k - key)

        :precondition (and

            ; Allow picking up only if:
            (hero-at ?loc) ; Hero is at the location
            (key-at ?k ?loc) ; Key is at the location
            (arm-free) ; Hero's arm is free
            (not (messy ?loc)) ; Location is not messy

        )

        :effect (and

            ; Set hero holding key, arm not free and key not at location:
            (holding ?k)
            (not (arm-free))
            (not (key-at ?k ?loc))

        )
    )

    ;Hero can drop a key if the
    ;    - hero is holding a key ?k,
    ;    - the hero is at location ?loc
    ;Effect will be that the hero is no longer holding the key
    (:action drop

        :parameters (?loc - location ?k - key)

        :precondition (and

            ; Allow dropping only if the hero is holding the key and the hero is at the location attempting to drop at:
            (not (arm-free))
            (holding ?k)
            (hero-at ?loc)

        )

        :effect (and

            ; Set hero arm free, key not held and key at location:
            (arm-free)
            (not (holding ?k))
            (key-at ?k ?loc)

        )
    )

    ;Hero can use a key for a corridor if
    ;    - the hero is holding a key ?k,
    ;    - the key still has some uses left,
    ;    - the corridor ?cor is locked with colour ?col,
    ;    - the key ?k is if the right colour ?col,
    ;    - the hero is at location ?loc
    ;    - the corridor is connected to the location ?loc
    ;Effect will be that the corridor is unlocked and the key usage will be updated if necessary
    (:action unlock

        :parameters (?loc - location ?cor - corridor ?col - colour ?k - key)

        :precondition (and

            ; Allow unlocking only if:
            (holding ?k) ; Hero is holding the key
            (key-usable ?k) ; Key is usable
            (locked ?cor) ; Corridor is locked
            (lock-colour ?cor ?col) ; Corridor is locked with the right colour
            (key-colour ?k ?col) ; Key is of the right colour
            (hero-at ?loc) ; Hero is at the location
            (connected ?loc ?cor) ; Corridor is connected to the location
        )

        :effect (and

            ; Set corridor not locked:

            ; When key is single use, set key not usable:
            (not (locked ?cor))
            (when
                (key-single-use ?k)
                (and
                    (not (key-single-use ?k))
                    (not (key-usable ?k))
                )
            )

            ; When key is double use, set key single use:
            (when
                (key-double-use ?k)
                (and
                    (not (key-double-use ?k))
                    (key-single-use ?k)
                )
            )
        )
    )

    ;Hero can clean a location if
    ;    - the hero is at location ?loc,
    ;    - the location is messy
    ;Effect will be that the location is no longer messy
    (:action clean

        :parameters (?loc - location)

        :precondition (and

            ; Allow cleaning only if the hero is at the location and the location is messy:
            (hero-at ?loc)
            (messy ?loc)

        )

        :effect (and

            ; Set room not messy:
            (not (messy ?loc))

        )
    )

)

; problem
(define (problem p3-dungeon)
  (:domain Dungeon)

  ; Naming convention:
  ; - loc-{i}-{j} refers to the location at the i'th column and j'th row (starting in top left corner)
  ; - c{i}{j}{h}{k} refers to the corridor connecting loc-{i}-{j} and loc-{h}-{k}
  (:objects
    loc-3-4 loc-4-5 loc-1-2 loc-2-2 loc-3-2 loc-3-3 loc-2-5 loc-1-3 loc-2-1 loc-1-4 loc-3-5 loc-2-4 loc-4-4 loc-2-3 loc-4-3 - location
    c2122 c1222 c2232 c1213 c1223 c2223 c3223 c3233 c1323 c2333 c1314 c2314 c2324 c2334 c3334 c1424 c2434 c2425 c2535 c3545 c4544 c4443 - corridor
    key1 key2 key3 key4 key5 key6 - key
  )

  (:init

    ; Hero location and carrying status
    (hero-at loc-2-1)
    (arm-free)

    ; Location <> Corridor Connections
    (corridor-between loc-2-1 loc-2-2 c2122)
    (corridor-between loc-2-2 loc-2-1 c2122)
    (connected loc-2-1 c2122)
    (connected loc-2-2 c2122)

    (corridor-between loc-1-2 loc-2-2 c1222)
    (corridor-between loc-2-2 loc-1-2 c1222)
    (connected loc-1-2 c1222)
    (connected loc-2-2 c1222)

    (corridor-between loc-2-2 loc-3-2 c2232)
    (corridor-between loc-3-2 loc-2-2 c2232)
    (connected loc-2-2 c2232)
    (connected loc-3-2 c2232)

    (corridor-between loc-1-2 loc-1-3 c1213)
    (corridor-between loc-1-3 loc-1-2 c1213)
    (connected loc-1-2 c1213)
    (connected loc-1-3 c1213)

    (corridor-between loc-1-2 loc-2-3 c1223)
    (corridor-between loc-2-3 loc-1-2 c1223)
    (connected loc-1-2 c1223)
    (connected loc-2-3 c1223)

    (corridor-between loc-2-2 loc-2-3 c2223)
    (corridor-between loc-2-3 loc-2-2 c2223)
    (connected loc-2-2 c2223)
    (connected loc-2-3 c2223)

    (corridor-between loc-3-2 loc-2-3 c3223)
    (corridor-between loc-2-3 loc-3-2 c3223)
    (connected loc-3-2 c3223)
    (connected loc-2-3 c3223)

    (corridor-between loc-3-2 loc-3-3 c3233)
    (corridor-between loc-3-3 loc-3-2 c3233)
    (connected loc-3-2 c3233)
    (connected loc-3-3 c3233)

    (corridor-between loc-1-3 loc-2-3 c1323)
    (corridor-between loc-2-3 loc-1-3 c1323)
    (connected loc-1-3 c1323)
    (connected loc-2-3 c1323)

    (corridor-between loc-2-3 loc-3-3 c2333)
    (corridor-between loc-3-3 loc-2-3 c2333)
    (connected loc-2-3 c2333)
    (connected loc-3-3 c2333)

    (corridor-between loc-1-3 loc-1-4 c1314)
    (corridor-between loc-1-4 loc-1-3 c1314)
    (connected loc-1-3 c1314)
    (connected loc-1-4 c1314)

    (corridor-between loc-2-3 loc-1-4 c2314)
    (corridor-between loc-1-4 loc-2-3 c2314)
    (connected loc-2-3 c2314)
    (connected loc-1-4 c2314)

    (corridor-between loc-2-3 loc-2-4 c2324)
    (corridor-between loc-2-4 loc-2-3 c2324)
    (connected loc-2-3 c2324)
    (connected loc-2-4 c2324)

    (corridor-between loc-2-3 loc-3-4 c2334)
    (corridor-between loc-3-4 loc-2-3 c2334)
    (connected loc-2-3 c2334)
    (connected loc-3-4 c2334)

    (corridor-between loc-3-3 loc-3-4 c3334)
    (corridor-between loc-3-4 loc-3-3 c3334)
    (connected loc-3-3 c3334)
    (connected loc-3-4 c3334)

    (corridor-between loc-1-4 loc-2-4 c1424)
    (corridor-between loc-2-4 loc-1-4 c1424)
    (connected loc-1-4 c1424)
    (connected loc-2-4 c1424)

    (corridor-between loc-2-4 loc-3-4 c2434)
    (corridor-between loc-3-4 loc-2-4 c2434)
    (connected loc-2-4 c2434)
    (connected loc-3-4 c2434)

    (corridor-between loc-2-4 loc-2-5 c2425)
    (corridor-between loc-2-5 loc-2-4 c2425)
    (connected loc-2-4 c2425)
    (connected loc-2-5 c2425)

    (corridor-between loc-2-5 loc-3-5 c2535)
    (corridor-between loc-3-5 loc-2-5 c2535)
    (connected loc-2-5 c2535)
    (connected loc-3-5 c2535)

    (corridor-between loc-3-5 loc-4-5 c3545)
    (corridor-between loc-4-5 loc-3-5 c3545)
    (connected loc-3-5 c3545)
    (connected loc-4-5 c3545)

    (corridor-between loc-4-5 loc-4-4 c4544)
    (corridor-between loc-4-4 loc-4-5 c4544)
    (connected loc-4-5 c4544)
    (connected loc-4-4 c4544)

    (corridor-between loc-4-4 loc-4-3 c4443)
    (corridor-between loc-4-3 loc-4-4 c4443)
    (connected loc-4-4 c4443)
    (connected loc-4-3 c4443)

    ; Key locations
    (key-at key1 loc-2-1)
    (key-at key2 loc-2-3)
    (key-at key3 loc-2-3)
    (key-at key4 loc-2-3)
    (key-at key5 loc-2-3)
    (key-at key6 loc-4-4)

    ; Locked corridors
    (locked c2223)
    (locked c3223)
    (locked c2333)
    (locked c2334)
    (locked c2324)
    (locked c2314)
    (locked c1323)
    (locked c1223)
    (locked c2425)
    (locked c2535)
    (locked c3545)
    (locked c4544)
    (locked c4443)

    ; Lock colours
    (lock-colour c2223 red)
    (lock-colour c3223 red)
    (lock-colour c2333 red)
    (lock-colour c2334 red)
    (lock-colour c2324 red)
    (lock-colour c2314 red)
    (lock-colour c1323 red)
    (lock-colour c1223 red)
    (lock-colour c2425 purple)
    (lock-colour c2535 green)
    (lock-colour c3545 purple)
    (lock-colour c4544 green)
    (lock-colour c4443 rainbow)

    ; Risky corridors
    (risky c2223)
    (risky c3223)
    (risky c2333)
    (risky c2334)
    (risky c2324)
    (risky c2314)
    (risky c1323)
    (risky c1223)

    ; Key colours
    (key-colour key1 red)
    (key-colour key2 green)
    (key-colour key3 green)
    (key-colour key4 purple)
    (key-colour key5 purple)
    (key-colour key6 rainbow)

    ; Key usage properties (one use, two use, etc)
    (key-usable key1)
    (key-usable key2)
    (key-usable key3)
    (key-usable key4)
    (key-usable key5)
    (key-usable key6)

    (key-single-use key2)
    (key-single-use key3)
    (key-single-use key4)
    (key-single-use key5)
    (key-single-use key6)

  )
  (:goal
    (and
      ; Hero's final location goes here
      (hero-at loc-4-3)
    )
  )

)

; plan
1. (pick-up loc-2-1 key1)
   deleted: (arm-free) (key-at key1 loc-2-1)
   added: (holding key1)
   goals met: 0 of 1
2. (move loc-2-1 loc-2-2 c2122)
   deleted: (hero-at loc-2-1)
   added: (hero-at loc-2-2)
   goals met: 0 of 1
3. (move loc-2-2 loc-1-2 c1222)
   deleted: (hero-at loc-2-2)
   added: (hero-at loc-1-2)
   goals met: 0 of 1
4. (unlock loc-1-2 c1223 red key1)
   deleted: (locked c1223)
   goals met: 0 of 1
5. (move loc-1-2 loc-1-3 c1213)
   deleted: (hero-at loc-1-2)
   added: (hero-at loc-1-3)
   goals met: 0 of 1
6. (unlock loc-1-3 c1323 red key1)
   deleted: (locked c1323)
   goals met: 0 of 1
7. (move loc-1-3 loc-1-4 c1314)
   deleted: (hero-at loc-1-3)
   added: (hero-at loc-1-4)
   goals met: 0 of 1
8. (unlock loc-1-4 c2314 red key1)
   deleted: (locked c2314)
   goals met: 0 of 1
9. (move loc-1-4 loc-2-4 c1424)
   deleted: (hero-at loc-1-4)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
10. (unlock loc-2-4 c2324 red key1)
   deleted: (locked c2324)
   goals met: 0 of 1
11. (drop loc-2-4 key1)
   deleted: (holding key1)
   added: (arm-free) (key-at key1 loc-2-4)
   goals met: 0 of 1
12. (move loc-2-4 loc-2-3 c2324)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-3) (messy loc-2-3) (collapsed c2324)
   goals met: 0 of 1
13. (clean loc-2-3)
   deleted: (messy loc-2-3)
   goals met: 0 of 1
14. (pick-up loc-2-3 key4)
   deleted: (arm-free) (key-at key4 loc-2-3)
   added: (holding key4)
   goals met: 0 of 1
15. (move loc-2-3 loc-1-4 c2314)
   deleted: (hero-at loc-2-3)
   added: (hero-at loc-1-4) (messy loc-1-4) (collapsed c2314)
   goals met: 0 of 1
16. (move loc-1-4 loc-2-4 c1424)
   deleted: (hero-at loc-1-4)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
17. (unlock loc-2-4 c2425 purple key4)
   deleted: (locked c2425) (key-single-use key4) (key-usable key4)
   goals met: 0 of 1
18. (move loc-2-4 loc-2-5 c2425)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
19. (drop loc-2-5 key4)
   deleted: (holding key4)
   added: (arm-free) (key-at key4 loc-2-5)
   goals met: 0 of 1
20. (move loc-2-5 loc-2-4 c2425)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
21. (move loc-2-4 loc-1-4 c1424)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-1-4)
   goals met: 0 of 1
22. (move loc-1-4 loc-1-3 c1314)
   deleted: (hero-at loc-1-4)
   added: (hero-at loc-1-3)
   goals met: 0 of 1
23. (move loc-1-3 loc-2-3 c1323)
   deleted: (hero-at loc-1-3)
   added: (hero-at loc-2-3) (messy loc-2-3) (collapsed c1323)
   goals met: 0 of 1
24. (clean loc-2-3)
   deleted: (messy loc-2-3)
   goals met: 0 of 1
25. (pick-up loc-2-3 key2)
   deleted: (arm-free) (key-at key2 loc-2-3)
   added: (holding key2)
   goals met: 0 of 1
26. (move loc-2-3 loc-1-2 c1223)
   deleted: (hero-at loc-2-3)
   added: (hero-at loc-1-2) (messy loc-1-2) (collapsed c1223)
   goals met: 0 of 1
27. (move loc-1-2 loc-1-3 c1213)
   deleted: (hero-at loc-1-2)
   added: (hero-at loc-1-3)
   goals met: 0 of 1
28. (move loc-1-3 loc-1-4 c1314)
   deleted: (hero-at loc-1-3)
   added: (hero-at loc-1-4)
   goals met: 0 of 1
29. (move loc-1-4 loc-2-4 c1424)
   deleted: (hero-at loc-1-4)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
30. (move loc-2-4 loc-2-5 c2425)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
31. (unlock loc-2-5 c2535 green key2)
   deleted: (locked c2535) (key-single-use key2) (key-usable key2)
   goals met: 0 of 1
32. (move loc-2-5 loc-3-5 c2535)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-3-5)
   goals met: 0 of 1
33. (drop loc-3-5 key2)
   deleted: (holding key2)
   added: (arm-free) (key-at key2 loc-3-5)
   goals met: 0 of 1
34. (move loc-3-5 loc-2-5 c2535)
   deleted: (hero-at loc-3-5)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
35. (move loc-2-5 loc-2-4 c2425)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
36. (pick-up loc-2-4 key1)
   deleted: (arm-free) (key-at key1 loc-2-4)
   added: (holding key1)
   goals met: 0 of 1
37. (move loc-2-4 loc-3-4 c2434)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-3-4)
   goals met: 0 of 1
38. (unlock loc-3-4 c2334 red key1)
   deleted: (locked c2334)
   goals met: 0 of 1
39. (move loc-3-4 loc-2-3 c2334)
   deleted: (hero-at loc-3-4)
   added: (hero-at loc-2-3) (messy loc-2-3) (collapsed c2334)
   goals met: 0 of 1
40. (unlock loc-2-3 c2333 red key1)
   deleted: (locked c2333)
   goals met: 0 of 1
41. (clean loc-2-3)
   deleted: (messy loc-2-3)
   goals met: 0 of 1
42. (unlock loc-2-3 c3223 red key1)
   deleted: (locked c3223)
   goals met: 0 of 1
43. (drop loc-2-3 key1)
   deleted: (holding key1)
   added: (arm-free) (key-at key1 loc-2-3)
   goals met: 0 of 1
44. (pick-up loc-2-3 key5)
   deleted: (arm-free) (key-at key5 loc-2-3)
   added: (holding key5)
   goals met: 0 of 1
45. (move loc-2-3 loc-3-2 c3223)
   deleted: (hero-at loc-2-3)
   added: (hero-at loc-3-2) (messy loc-3-2) (collapsed c3223)
   goals met: 0 of 1
46. (move loc-3-2 loc-3-3 c3233)
   deleted: (hero-at loc-3-2)
   added: (hero-at loc-3-3)
   goals met: 0 of 1
47. (move loc-3-3 loc-3-4 c3334)
   deleted: (hero-at loc-3-3)
   added: (hero-at loc-3-4)
   goals met: 0 of 1
48. (move loc-3-4 loc-2-4 c2434)
   deleted: (hero-at loc-3-4)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
49. (move loc-2-4 loc-2-5 c2425)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
50. (move loc-2-5 loc-3-5 c2535)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-3-5)
   goals met: 0 of 1
51. (unlock loc-3-5 c3545 purple key5)
   deleted: (locked c3545) (key-single-use key5) (key-usable key5)
   goals met: 0 of 1
52. (move loc-3-5 loc-4-5 c3545)
   deleted: (hero-at loc-3-5)
   added: (hero-at loc-4-5)
   goals met: 0 of 1
53. (drop loc-4-5 key5)
   deleted: (holding key5)
   added: (arm-free) (key-at key5 loc-4-5)
   goals met: 0 of 1
54. (move loc-4-5 loc-3-5 c3545)
   deleted: (hero-at loc-4-5)
   added: (hero-at loc-3-5)
   goals met: 0 of 1
55. (move loc-3-5 loc-2-5 c2535)
   deleted: (hero-at loc-3-5)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
56. (move loc-2-5 loc-2-4 c2425)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
57. (move loc-2-4 loc-3-4 c2434)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-3-4)
   goals met: 0 of 1
58. (move loc-3-4 loc-3-3 c3334)
   deleted: (hero-at loc-3-4)
   added: (hero-at loc-3-3)
   goals met: 0 of 1
59. (move loc-3-3 loc-2-3 c2333)
   deleted: (hero-at loc-3-3)
   added: (hero-at loc-2-3) (messy loc-2-3) (collapsed c2333)
   goals met: 0 of 1
60. (clean loc-2-3)
   deleted: (messy loc-2-3)
   goals met: 0 of 1
61. (pick-up loc-2-3 key1)
   deleted: (arm-free) (key-at key1 loc-2-3)
   added: (holding key1)
   goals met: 0 of 1
62. (unlock loc-2-3 c2223 red key1)
   deleted: (locked c2223)
   goals met: 0 of 1
63. (drop loc-2-3 key1)
   deleted: (holding key1)
   added: (arm-free) (key-at key1 loc-2-3)
   goals met: 0 of 1
64. (pick-up loc-2-3 key3)
   deleted: (arm-free) (key-at key3 loc-2-3)
   added: (holding key3)
   goals met: 0 of 1
65. (move loc-2-3 loc-2-2 c2223)
   deleted: (hero-at loc-2-3)
   added: (hero-at loc-2-2) (messy loc-2-2) (collapsed c2223)
   goals met: 0 of 1
66. (move loc-2-2 loc-1-2 c1222)
   deleted: (hero-at loc-2-2)
   added: (hero-at loc-1-2)
   goals met: 0 of 1
67. (move loc-1-2 loc-1-3 c1213)
   deleted: (hero-at loc-1-2)
   added: (hero-at loc-1-3)
   goals met: 0 of 1
68. (move loc-1-3 loc-1-4 c1314)
   deleted: (hero-at loc-1-3)
   added: (hero-at loc-1-4)
   goals met: 0 of 1
69. (move loc-1-4 loc-2-4 c1424)
   deleted: (hero-at loc-1-4)
   added: (hero-at loc-2-4)
   goals met: 0 of 1
70. (move loc-2-4 loc-2-5 c2425)
   deleted: (hero-at loc-2-4)
   added: (hero-at loc-2-5)
   goals met: 0 of 1
71. (move loc-2-5 loc-3-5 c2535)
   deleted: (hero-at loc-2-5)
   added: (hero-at loc-3-5)
   goals met: 0 of 1
72. (move loc-3-5 loc-4-5 c3545)
   deleted: (hero-at loc-3-5)
   added: (hero-at loc-4-5)
   goals met: 0 of 1
73. (unlock loc-4-5 c4544 green key3)
   deleted: (locked c4544) (key-single-use key3) (key-usable key3)
   goals met: 0 of 1
74. (move loc-4-5 loc-4-4 c4544)
   deleted: (hero-at loc-4-5)
   added: (hero-at loc-4-4)
   goals met: 0 of 1
75. (drop loc-4-4 key3)
   deleted: (holding key3)
   added: (arm-free) (key-at key3 loc-4-4)
   goals met: 0 of 1
76. (pick-up loc-4-4 key6)
   deleted: (arm-free) (key-at key6 loc-4-4)
   added: (holding key6)
   goals met: 0 of 1
77. (unlock loc-4-4 c4443 rainbow key6)
   deleted: (locked c4443) (key-single-use key6) (key-usable key6)
   goals met: 0 of 1
78. (move loc-4-4 loc-4-3 c4443)
   deleted: (hero-at loc-4-4)
   added: (hero-at loc-4-3)
   goals met: 1 of 1
